hisn_translations_ru = {
    # Morning
    "dhikr_hisn_morning_1_7079504423173924192": {
        "content": "Тафсир: Аят аль-Курси (Аль-Бакара 255). Аллах — нет божества, кроме Него, Живого, Поддерживающего жизнь. Им не овладевают ни дремота, ни сон. Ему принадлежит то, что на небесах, и то, что на земле. Кто станет заступаться перед Ним без Его дозволения? Он знает их будущее и прошлое. Они постигают из Его знания только то, что Он пожелает. Его Престол (Курси) объемлет небеса и землю, и не тяготит Его оберегание их. Он — Возвышенный, Великий.",
        "fadl": "Тот, кто прочитает это утром, будет защищен от джиннов до вечера. Тот, кто прочитает это вечером, будет защищен до утра."
    },
    "dhikr_hisn_morning_2_2977055638822290111": {
        "content": "Тафсир: Сура Аль-Ихляс. Скажи: «Он — Аллах Единый, Аллах Самодостаточный. Он не родил и не был рожден, и нет никого, равного Ему».",
        "fadl": ""
    },
    "dhikr_hisn_morning_3_3692430353769486885": {
        "content": "Тафсир: Сура Аль-Фаляк. Скажи: «Я прибегаю к защите Господа рассвета от зла того, что Он сотворил, от зла мрака, когда он наступает, от зла колдуний, дующих на узлы, от зла завистника, когда он завидует».",
        "fadl": ""
    },
    "dhikr_hisn_morning_4_4256880019713768647": {
        "content": "Тафсир: Сура Ан-Нас. Скажи: «Я прибегаю к защите Господа людей, Царя людей, Бога людей, от зла искусителя исчезающего, который наущает в груди людей, от джиннов и людей».",
        "fadl": ""
    },
    "dhikr_hisn_morning_5_3632402383039933333": {
        "content": "Мы дожили до утра, и этим утром вся власть принадлежит Аллаху. Вся хвала Аллаху. Нет божества, кроме Аллаха, Единого; нет у Него сотоварища. Ему принадлежит власть, и Ему надлежит хвала, и Он способен на всякую вещь. Мой Господь, я прошу у Тебя блага этого дня и блага того, что за ним последует, и я ищу у Тебя защиты от зла этого дня и зла того, что за ним последует. Мой Господь, я ищу у Тебя защиты от лени и дряхлости. Мой Господь, я ищу у Тебя защиты от мучений в Огне и мучений в могиле.",
        "fadl": ""
    },
    "dhikr_hisn_morning_6_3995984418833858601": {
        "content": "О Аллах, благодаря Тебе мы дожили до утра, и благодаря Тебе мы доживем до вечера, благодаря Тебе мы живем, и благодаря Тебе мы умираем, и к Тебе наше окончательное возвращение.",
        "fadl": ""
    },
    "dhikr_hisn_morning_7_881503868725224313": {
        "content": "О Аллах, Ты — мой Господь. Нет божества, кроме Тебя. Ты создал меня, и я — Твой раб. Я верен своему завету и обещанию Тебе, насколько это в моих силах. Я ищу у Тебя защиты от зла того, что я совершил. Я признаю Твои милости ко мне, и я признаю свои грехи. Так прости же меня, ибо никто не прощает грехи, кроме Тебя.",
        "fadl": "Тот, кто произнесет это с твердой убежденностью днем и умрет в тот же день до наступления вечера, будет из числа обитателей Рая; и тот, кто произнесет это с твердой убежденностью ночью и умрет до наступления утра, будет из числа обитателей Рая."
    },
    "dhikr_hisn_morning_8_7338447846969089968": {
        "content": "О Аллах, я встретил утро, призывая Тебя в свидетели, а также носителей Твоего Трона, Твоих ангелов и все Твои творения, что Ты — Аллах, нет божества, кроме Тебя, Единого, у Которого нет сотоварища, и что Мухаммад — Твой раб и Твой Посланник.",
        "fadl": ""
    },
    "dhikr_hisn_morning_9_1750195579169879923": {
        "content": "О Аллах, какая бы милость ни постигла меня или кого-либо из Твоих творений, она исходит только от Тебя, нет у Тебя сотоварища. Тебе принадлежит вся хвала и вся благодарность.",
        "fadl": ""
    },
    "dhikr_hisn_morning_10_1648015174208386772": {
        "content": "О Аллах, даруй моему телу здоровье. О Аллах, даруй моему слуху здоровье. О Аллах, даруй моему зрению здоровье. Нет божества, кроме Тебя. О Аллах, я прибегаю к Тебе от неверия и бедности, и я прибегаю к Тебе от мучений могилы. Нет божества, кроме Тебя.",
        "fadl": ""
    },
    "dhikr_hisn_morning_11_6363159766113566470": {
        "content": "Тафсир: (Ат-Тауба 129). Достаточно мне Аллаха! Нет божества, кроме Него. На Него я уповаю, и Он — Господь Великого Трона.",
        "fadl": ""
    },
    "dhikr_hisn_morning_12_6900536571644592466": {
        "content": "С Именем Аллаха, с Именем Которого ничто не может причинить вреда ни на земле, ни на небесах, и Он — Всеслышащий, Всезнающий.",
        "fadl": ""
    },
    "dhikr_hisn_morning_13_8175346774018819611": {
        "content": "Я доволен Аллахом как Господом, Исламом как религией и Мухаммадом, мир ему и благословение, как Пророком.",
        "fadl": ""
    },
    "dhikr_hisn_morning_14_8236506699031727758": {
        "content": "О Живой, О Поддерживающий жизнь, к Твоей милости я взываю о помощи. Исправь для меня все мои дела и не оставляй меня на самого себя даже на мгновение ока.",
        "fadl": ""
    },
    "dhikr_hisn_morning_15_794307206129591863": {
        "content": "Мы дожили до утра в естестве Ислама, со словом искренней преданности, в религии нашего Пророка Мухаммада, мир ему и благословение, и в наследии нашего праотца Ибрахима, который был мусульманином истинной веры и не был из числа многобожников.",
        "fadl": ""
    },
    "dhikr_hisn_morning_16_4682873266589736707": {
        "content": "Слава Аллаху и хвала Ему.",
        "fadl": ""
    },
    "dhikr_hisn_morning_17_7777687160097218599": {
        "content": "Нет божества, кроме Аллаха Единого, нет у Него сотоварища. Ему принадлежит власть и Ему хвала, и Он способен на всякую вещь.",
        "fadl": ""
    },
    "dhikr_hisn_morning_18_5114679884659653995": {
        "content": "Слава Аллаху и хвала Ему по числу Его творений, по Его Довольству, по весу Его Трона и по количеству чернил для Его Слов.",
        "fadl": ""
    },
    "dhikr_hisn_morning_19_724359062665347364": {
        "content": "О Аллах, я прошу у Тебя полезного знания, благого удела и принятых деяний.",
        "fadl": ""
    },
    "dhikr_hisn_morning_20_3951607121977491583": {
        "content": "Я прошу прощения у Аллаха и каюсь перед Ним.",
        "fadl": ""
    },
    "dhikr_hisn_morning_21_7167435443392338898": {
        "content": "О Аллах, ниспошли благословения и мир нашему Пророку Мухаммаду.",
        "fadl": ""
    },

    # Evening
    "dhikr_hisn_evening_1_7079504423173924192": {
        "content": "Тафсир: Аят аль-Курси (Аль-Бакара 255). Аллах — нет божества, кроме Него, Живого, Поддерживающего жизнь. Им не овладевают ни дремота, ни сон. Ему принадлежит то, что на небесах, и то, что на земле. Кто станет заступаться перед Ним без Его дозволения? Он знает их будущее и прошлое. Они постигают из Его знания только то, что Он пожелает. Его Престол (Курси) объемлет небеса и землю, и не тяготит Его оберегание их. Он — Возвышенный, Великий.",
        "fadl": ""
    },
    "dhikr_hisn_evening_2_2977055638822290111": {
        "content": "Тафсир: Сура Аль-Ихляс. Скажи: «Он — Аллах Единый, Аллах Самодостаточный. Он не родил и не был рожден, и нет никого, равного Ему».",
        "fadl": ""
    },
    "dhikr_hisn_evening_3_3692430353769486885": {
        "content": "Тафсир: Сура Аль-Фаляк. Скажи: «Я прибегаю к защите Господа рассвета от зла того, что Он сотворил, от зла мрака, когда он наступает, от зла колдуний, дующих на узлы, от зла завистника, когда он завидует».",
        "fadl": ""
    },
    "dhikr_hisn_evening_4_4256880019713768647": {
        "content": "Тафсир: Сура Ан-Нас. Скажи: «Я прибегаю к защите Господа людей, Царя людей, Бога людей, от зла искусителя исчезающего, который наущает в груди людей, от джиннов и людей».",
        "fadl": ""
    },
    "dhikr_hisn_evening_5_4243174872530309414": {
        "content": "Мы дожили до вечера, и в это время вся власть принадлежит Аллаху. Вся хвала Аллаху. Нет божества, кроме Аллаха, Единого; нет у Него сотоварища. Ему принадлежит власть, и Ему надлежит хвала, и Он способен на всякую вещь. Мой Господь, я прошу у Тебя блага этой ночи и блага того, что за ней последует, и я ищу у Тебя защиты от зла этой ночи и зла того, что за ней последует. Мой Господь, я ищу у Тебя защиты от лени и дряхлости. Мой Господь, я ищу у Тебя защиты от мучений в Огне и мучений в могиле.",
        "fadl": ""
    },
    "dhikr_hisn_evening_6_7475454792143668977": {
        "content": "О Аллах, благодаря Тебе мы дожили до вечера, и благодаря Тебе мы доживем до утра, благодаря Тебе мы живем, и благодаря Тебе мы умираем, и к Тебе возвращение.",
        "fadl": ""
    },
    "dhikr_hisn_evening_7_881503868725224313": {
        "content": "О Аллах, Ты — мой Господь. Нет божества, кроме Тебя. Ты создал меня, и я — Твой раб. Я верен своему завету и обещанию Тебе, насколько это в моих силах. Я ищу у Тебя защиты от зла того, что я совершил. Я признаю Твои милости ко мне, и я признаю свои грехи. Так прости же меня, ибо никто не прощает грехи, кроме Тебя.",
        "fadl": ""
    },
    "dhikr_hisn_evening_8_8909673216696765171": {
        "content": "О Аллах, я встретил вечер, призывая Тебя в свидетели, а также носителей Твоего Трона, Твоих ангелов и все Твои творения, что Ты — Аллах, нет божества, кроме Тебя, Единого, у Которого нет сотоварища, и что Мухаммад — Твой раб и Твой Посланник.",
        "fadl": ""
    },
    "dhikr_hisn_evening_9_8975060277116335622": {
        "content": "О Аллах, какая бы милость ни постигла меня или кого-либо из Твоих творений, она исходит только от Тебя, нет у Тебя сотоварища. Тебе принадлежит вся хвала и вся благодарность.",
        "fadl": ""
    },
    "dhikr_hisn_evening_10_1648015174208386772": {
        "content": "О Аллах, даруй моему телу здоровье. О Аллах, даруй моему слуху здоровье. О Аллах, даруй моему зрению здоровье. Нет божества, кроме Тебя. О Аллах, я прибегаю к Тебе от неверия и бедности, и я прибегаю к Тебе от мучений могилы. Нет божества, кроме Тебя.",
        "fadl": ""
    },
    "dhikr_hisn_evening_11_6363159766113566470": {
        "content": "Тафсир: (Ат-Тауба 129). Достаточно мне Аллаха! Нет божества, кроме Него. На Него я уповаю, и Он — Господь Великого Трона.",
        "fadl": ""
    },
    "dhikr_hisn_evening_12_6900536571644592466": {
        "content": "С Именем Аллаха, с Именем Которого ничто не может причинить вреда ни на земле, ни на небесах, и Он — Всеслышащий, Всезнающий.",
        "fadl": ""
    },
    "dhikr_hisn_evening_13_8175346774018819611": {
        "content": "Я доволен Аллахом как Господом, Исламом как религией и Мухаммадом, мир ему и благословение, как Пророком.",
        "fadl": ""
    },
    "dhikr_hisn_evening_14_8236506699031727758": {
        "content": "О Живой, О Поддерживающий жизнь, к Твоей милости я взываю о помощи. Исправь для меня все мои дела и не оставляй меня на самого себя даже на мгновение ока.",
        "fadl": ""
    },
    "dhikr_hisn_evening_15_5388345519762154973": {
        "content": "Мы дожили до вечера в естестве Ислама, со словом искренней преданности, в религии нашего Пророка Мухаммада, мир ему и благословение, и в наследии нашего праотца Ибрахима, который был мусульманином истинной веры и не был из числа многобожников.",
        "fadl": ""
    },
    "dhikr_hisn_evening_16_4682873266589736707": {
        "content": "Слава Аллаху и хвала Ему.",
        "fadl": ""
    },
    "dhikr_hisn_evening_17_7777687160097218599": {
        "content": "Нет божества, кроме Аллаха Единого, нет у Него сотоварища. Ему принадлежит власть и Ему хвала, и Он способен на всякую вещь.",
        "fadl": ""
    },
    "dhikr_hisn_evening_18_4626338301481658107": {
        "content": "Я прибегаю к защите совершенных Слов Аллаха от зла того, что Он сотворил.",
        "fadl": ""
    },
    "dhikr_hisn_evening_19_7167435443392338898": {
        "content": "О Аллах, ниспошли благословения и мир нашему Пророку Мухаммаду.",
        "fadl": ""
    },

    # Sleep
    "dhikr_hisn_sleep_1_2977055638822290111": {
        "content": "Тафсир: Сура Аль-Ихляс. Скажи: «Он — Аллах Единый, Аллах Самодостаточный. Он не родил и не был рожден, и нет никого, равного Ему».",
        "fadl": ""
    },
    "dhikr_hisn_sleep_2_3692430353769486885": {
        "content": "Тафсир: Сура Аль-Фаляк. Скажи: «Я прибегаю к защите Господа рассвета от зла того, что Он сотворил, от зла мрака, когда он наступает, от зла колдуний, дующих на узлы, от зла завистника, когда он завидует».",
        "fadl": ""
    },
    "dhikr_hisn_sleep_3_4256880019713768647": {
        "content": "Тафсир: Сура Ан-Нас. Скажи: «Я прибегаю к защите Господа людей, Царя людей, Бога людей, от зла искусителя исчезающего, который наущает в груди людей, от джиннов и людей».",
        "fadl": ""
    },
    "dhikr_hisn_sleep_4_5589047701272255905": {
        "content": "С Именем Твоим, мой Господь, я укладываюсь на бок, и с Именем Твоим я поднимаюсь. Если Ты заберешь мою душу, то смилуйся над ней, а если Ты вернешь ее, то защити ее так же, как Ты защищаешь Своих праведных рабов.",
        "fadl": ""
    },
    "dhikr_hisn_sleep_5_289759019052258030": {
        "content": "О Аллах, Ты сотворил мою душу, и Ты заберешь ее. Тебе принадлежит ее смерть и ее жизнь. Если Ты даруешь ей жизнь, то сохрани ее; а если умертвишь ее, то прости ей. О Аллах, я прошу у Тебя благополучия.",
        "fadl": ""
    },
    "dhikr_hisn_sleep_6_6450838689095358238": {
        "content": "О Аллах, защити меня от Твоего наказания в тот день, когда Ты воскресишь Своих рабов.",
        "fadl": ""
    },
    "dhikr_hisn_sleep_7_9184685090631130541": {
        "content": "С Именем Твоим, о Аллах, я умираю и оживаю.",
        "fadl": ""
    },
    "dhikr_hisn_sleep_8_6957368716742325606": {
        "content": "Субханаллах (33), Альхамдулиллях (33), Аллаху Акбар (34)",
        "fadl": ""
    },

    # Prayer
    "dhikr_hisn_prayer_1_957377000138407204": {
        "content": "Астагфируллах (3 раза). О Аллах, Ты — Мир (Ас-Салям), и от Тебя — мир. Благословен Ты, о Обладатель величия и щедрости.",
        "fadl": ""
    },
    "dhikr_hisn_prayer_2_1947054263731481278": {
        "content": "Нет божества, кроме Аллаха Единого, нет у Него сотоварища. Ему принадлежит власть, и Ему хвала, и Он способен на всякую вещь. О Аллах, никто не лишит того, что Ты даровал, и никто не дарует того, чего Ты лишил; и величие обладающего величием не принесет ему пользы перед Тобой.",
        "fadl": ""
    },
    "dhikr_hisn_prayer_3_6642781802666049892": {
        "content": "Субханаллах (33), Альхамдулиллях (33), Аллаху Акбар (33). Нет божества, кроме Аллаха Единого, нет у Него сотоварища. Ему принадлежит власть, и Ему хвала, и Он способен на всякую вещь.",
        "fadl": ""
    },
    "dhikr_hisn_prayer_4_6382380350583054994": {
        "content": "Тафсир: Прочитайте суры Аль-Ихляс, Аль-Фаляк и Ан-Нас.",
        "fadl": ""
    },
    "dhikr_hisn_prayer_5_4836042055883755566": {
        "content": "Тафсир: Прочитайте Аят аль-Курси (Аль-Бакара 255).",
        "fadl": ""
    },

    # Food
    "dhikr_hisn_food_1_4633489757505462665": {
        "content": "Бисмиллях (С Именем Аллаха).",
        "fadl": ""
    },
    "dhikr_hisn_food_2_2061999047830799143": {
        "content": "Хвала Аллаху, Кто накормил меня этим и наделил меня этим без всякой силы и мощи с моей стороны.",
        "fadl": "Кто произнесет это, тому будут прощены его прошлые грехи."
    },

    # Travel
    "dhikr_hisn_travel_1_1692290173954479326": {
        "content": "Тафсир: (Аз-Зухруф 13-14) Аллах Велик, Аллах Велик, Аллах Велик. Пречист Тот, Кто подчинил нам это, ведь мы сами на такое были неспособны. Поистине, мы вернемся к нашему Господу.",
        "fadl": ""
    },
    "dhikr_hisn_travel_2_4663386982220524668": {
        "content": "О Аллах, мы просим у Тебя благочестия и богобоязненности в этом нашем пути, и (мы просим у Тебя) деяний, которыми Ты будешь доволен. О Аллах, облегчи нам этот путь, и сократи для нас его расстояние. О Аллах, Ты — Спутник в пути и Заместитель в семье. О Аллах, я прибегаю к Тебе от трудностей пути, от печальных зрелищ и дурного исхода в имуществе, семье и детях.",
        "fadl": ""
    },

    # Mosque
    "dhikr_hisn_mosque_1_2073202005614126402": {
        "content": "Я прибегаю к защите Аллаха Великого, Его Благородного Лика и Его Предвечной Власти от проклятого шайтана. С именем Аллаха, мир и благословение Посланнику Аллаха. О Аллах, открой для меня врата Твоей милости.",
        "fadl": ""
    },
    "dhikr_hisn_mosque_2_3859017073855939996": {
        "content": "С именем Аллаха, мир и благословение Посланнику Аллаха. О Аллах, я прошу у Тебя Твоей милости. О Аллах, защити меня от проклятого шайтана.",
        "fadl": ""
    }
}

hisn_titles_ru = {
    "hisn_morning": "Утренние Азкары",
    "hisn_evening": "Вечерние Азкары",
    "hisn_sleep": "Азкары перед сном",
    "hisn_prayer": "Азкары после молитвы",
    "hisn_food": "Азкары еды",
    "hisn_travel": "Азкары в пути",
    "hisn_mosque": "Азкары мечети"
}
